function make2() {
  var x = document.getElementById( "satoshi" );
  var content = [];
  var key = "";
  var i;
  for ( i = 0; i < x.length; i++ ) {
    key += x.elements[ i ].value;
  }
// tOdo: dsada
 
    let message = "";
    const sadako = document.getElementById("sadako").checked;
    const hi_tori = document.getElementById("hi_tori").checked;
      if (sadako) {
        // 好
        message = "氉耩绉艤弐纃紖縀荴蜄忽欼弐憑禉葊聹朆聹笔搱榕忤惍泣圇忽彴弐津篧荤繘愕籁織碵薣翙淔惷葆紙笔篝菛忤惍荴蚏籁欼忚肽耾蚉舭蜄櫵斌擻橹梒朗胦肞粭紜碵曩耾蛼胦缿耍胄撖纃繅荤暀殘粭榜穉椣暙楖槨棚枕窬祿纃穓縀椎氍楅筼敠翙暙棣柇槄栁柼枾纃梒欢橕柰荭臼統縑紖薣竰蔰綅艤翏罧昴棣缲秃荭晜肙蒿秮膘繘蝹腑枔矫梱杣柽易膈绉篤忚渉噬惍思淡膽彴祿芅碿蘖荴湖惕纼穉绵篧葊惷滋痭秜篝薣翙縀思牳筩胄統脯笝縀思簌筩脬翏脯翙蚉絾蚏忽桤弐衏穓縀茇蜄禹櫔擻葍櫰囫氉柰粭紜胾渉噬浡紑色葅彴祿芅碿蘖荴愕氹彴忚纃繅英斦葆粭撼更憑弚湇嚿愕母紜統聋弚绦聹绊茁脬檁憑絻翌紑色腑恄弐薣罴绦汶懿繝膔耴葍翙汻暀柰楅椴撖苷穓罙缲绊日膔肙苷礤英茇杻籁羌統杛敪罙簷耩枕曄穉栿碿罙粤棚栁柼祿樇梒绦楻桥樝晜穉榕穓縀粤楏朩枔敠橹攅蚉葎葆篕織罪粻繅蛼薕蔰葅莜祿翙敪琞杚蚏籁胄祿梱缏葊杚締棙旴敠曩籌蒽繘懿沥嚄弐悭樦蒽思羴耍秜翏薣檋憳胦肞粭紜縻憑櫰睃篊羴繝筼紌悭烛绦篊耩筩纼翏津攅蒽泣圇母斌秤脯脈湇嚿淡粭紜胾悭禉英篊蜄茁彴檁悭忤绦臀菑敹纼秤晷曾憳思滋嚵彴樜脯絻育思羴耍秜翏薣檋憳胦肞粭紜縻憑弚蘖茇羴氹恄筸蘕耾蒽荴泷晑斌篝曩纪膘腓色聹籌撖纃繅荤暀檮楅枔臈杛暙樼暀缿榱斌昪橹攅楖椎缿榱曄枾綟柈槉緫楏紙秜秤每棷翌絾耩樝本敠纃禉耿槨殘榱棌穉樇禉朗羟薥緱恄櫦囡弚惍氉薥忽窬紌綟翙蘖汶懿聹筼秤脯繅憳泣由紙紜笓肽耾葊腓愕狹秜罪脯翙蘖篊愕狹筼穉薣耾翌茇淡晑翴櫦囡樦枊紑色葅殤噢津秮膘蒻愕籁織碵薣翙惍汶愕惕窬縻芅搻荤紑朆桭恄弐渉弚囫氉色聹籌弐纃紖縀荴蜄氹恄統罧秮膘臀懿忽脬罪纃檋憳绅蝹荭翴翏汁攅枊荴朆聹筼秤脯碿暤粤绊籁粴穉晷碿艾曭杻膽紜緖脯絻育易羴腑纼擻樇柈槉薕柰篕穄擻柍窸枊杚槄晑穄礚柍窸桰栴肞粭秜更歝族繳橕槄紙旴枾榕禉棣栴殘栁本窮纃敪欢篊殘籁攤籂葍笝憳泣圇忽彴樜葍弚绦聹绊茁脬檁憑絻翌紑色腑恄櫦綟紖翌薕色茁彴礚芅穓罙絾菑母斌纠渉噬浡暀耩绉艤櫦囡樦罙缲衣忽窬紌綟翙蘖思湖忽恄祿菛紖暤胦耩敹枔忚悭櫰惍嚿淡绉纼笓悭禉英篊蜄茁欼忚苷穓罙缲蔰惕彴翏蔱禉淔惷臽荭膔纠薣楜枊暀欣樝攤統罧秮膘篊杻荭臼統縑紖薣易羴腑纼擻翙族氈椎肞棙枔旅椣族棣簷檮粭穄棭樇礤楖椎樹篕筼秤橹秮槉曭氍紙棌昪杛耾蛼胦缿耍胄矫荩笝葊葎色朩璔玔礫杣桰菡色绉榜芒肽繅桰竰檮暽旴撖聋篧耿惷滋嚵彴弐津纪惍粤菑筩脬翏涗忤荤絾耩绉羌忚渉箂縀腓蒻筩粴弐苷肣薣茇绊薉櫔擻葍櫰囫氉柰粭紜胾渉噬浡紑色葅彴祿芅碿蘖荴愕氹彴忚纃繅英斦葆粭撼更憑弚湇思圇母紜統聋弚绦聹绊茁脬檁憑絻翌紑色腑恄弐薣罴绦汶懿繝膔耴葍翙汻暀柰楅椴撖苷穓罙缲绊日膔肙苷礤英茇杻籁羌統杛曾縀梡棚朩椴礚翙秮楖絾槄籁窬更翙棷槉櫂檮棙筼祿纃碿柽杚欣檉柼杙栿攅蚉葎葆篕織罪粻繅氈芚蔰朩榜缅盱窸狅杚蟮薉苌栣橹芜葊椎締枕柼敠曩笝膘緫懿沥嚄弐悭樦蒽思羴耍秜翏薣檋憳胦肞粭紜縻憑櫰脥篊蒻胥秜筸悭絻蛼茇蚏筩莜樜杛纪湇嚿淡晑笔篝蛹櫰囫氉耩绉艤弐纃紖縀荴蜄忽欼弐憑禉葊聹朆聹笔搱榕忤惍泣愕母翴弐纃紖縀荴蜄氹恄統罧秮膘臀懿沥窬碵荩耾葊茇绊母斌纠渉弚囫氉柰粭紜胾渉弚囫氉耩绉艤弐纃紖縀荴蜄氹恄祿菛紖暤胦耩敹枔忚渉弚浡缲葆緱彴祿芅碿蘖荴湖惕纼穉绵篧葊惷愕茁胄祿涗忤脥菡蝹膽脬楒杛攅膘易薥绉缤篝苷笝朗粤蔰聹斌杙橹曾衕暀殘栁斌杙綟攅樼槨柰榱本杙綟杣欢粤棚棙穄敠歝柈檯椎绊籁穄秤梱窸欢櫂脓紙穄碵绵窸氈緫氍日綄纠聋忤湇嚿淡膽彴祿芅碿蘖荴湖惕纼穉绵篧葊惷滋忽綄碵薣絻膘腓肞忽膔筸菛絻蒽荴蔰胥橬祿綟締蚉臀蚏筩彴樜杛纪湇思淡晑笔篝蛹弚湇思圇母笔篝蛹弚绦聹绊茁脬檁憑禉葊聹朆聹笔搱榕忤湇嚿淡绉纼笓悭禉英篊蜄茁欼忚苷穓罙缲蔰惕彴翏蔱禉淔惷臽荭膔纠薣楜枊暀欣樝攤統罧秮膘篊杻荭臼統縑紖薣易羴腑纼擻栿昴氈緫殘楅晜更橹碿罙粤棚棙穄秤綟窸檯絾楏紙窬礚每穓欢椎脓桭旴暏杛耾蛼胦缿耍胄矫菛碿舋椎裘檉浄昪榕球桰荴肞胥穄耴葍繅桰竰檮桭旴撖膡纪育惷滋嚵櫔纠悭禉英篊蜄茁欼忚苷穓罙缲蔰惕殤穉芅篧蘖絾愕荭胄縻蚇腭惍易羴筩缤耴菛罴縀氉柰膽殤噢津攅罙缲衣沥嚄樜绵篧蝯思羴耍秜翏薣檋憳粤蔰耍撼統绵搻槉惷滋嚵櫔篝苷笝惍粤菑筩脬翏涗忤荤絾耩绉羌忚悭翙薣粤湖惕粴耴蘕纪蘖欯柰晑桤梈曩絻翌紑色筩攤耴蚇絻繳聹蚏日窬縻苷攅氈楻桥檉榜穉柍栭桰緫桥榱窬更榕碿耿槨脓枕椴碵橹棷楖曭檮篕桤敠樇秮枊菡蟮聹穄紌蔱矵葊菡槄朩曄肙葍甲棣缲棚蒱臼籂蘕繅菗臀棚窑柼更柍撠舋舭膈惕殤噢津纪惍粤菑筩脬翏涗忤荤絾耩绉羌忚渉翙縀荴臽筩彴翏葍篧英簷肞芕籌弐昅禉縀腓蝹腑胄碵悭罴蛼荴蜄筩櫔擻葍櫰囫氉柰粭紜胾渉噬浡紑色葅彴祿芅碿蘖荴湖惕窬縻芅搻荤紑朆桭恄櫦囡樦膘胦膈忽窬紌綟翙蘖汶懿聹筼秤脯繅憳思蜄芕窬檁憑箂蚉菡薥茁樄擻杛栭殕易葆紙笔篝綟撠蚉葎葆篕織罪曩禉葊胦柰枕筼枾櫫窸繳緫殘暽柼旅梱窸欢橕缿栁榜梈縑暙楖紑沂粭柼礚每敪槉緫槄晑膔肙苷礤英茇締腑缤昪蛹栭绦羟襍缵茴旅蒿禉蒽茇脓枕羌更粻曾柽曭杻緱紜窮憑櫰囫氉薥忽窬紌綟翙蘖汶懿聹筼秤脯繅憳泣羴繝胄篝薣翙裈思羴腑脬耴綟締褻篊愕攍窬碵荩耾葊茇绊忽脬耴蔱穓縀胦肞芕櫔擻葍櫰囫氉绊忽粴罪罧窸淔惷臽荭膔纠薣楜枊暀裘蒱苌撖蘕腭膘菡羴繝攤耴蛹攅绦绅蚏绉脬翏衏繅耿緫色籁紜碵芅忤湇癁裘绉膔祿肽樦枊篊滋嚵櫔擻绵篧蝯泣圇母笔篝蛹弚绦聹绊茁脬檁憑禉葊聹朆聹笔搱榕忤湇嚿淡膽彴祿芅碿蘖荴湖惕纼穉绵篧葊惷滋蔝茴臈津攅蒽思滋嚵櫔擻绵篧蝯泣圇母笔篝蛹弚绦聹绊茁脬檁憑禉葊聹朆聹笔搱榕忤湇嚿淡绉纼笓悭禉英篊蜄茁欼忚苷穓罙缲蔰惕彴翏蔱禉淔惷臽荭膔纠薣楜枊暀欣樝攤統罧秮膘篊杻荭臼統縑紖薣易羴腑纼擻罧柈柽曭槄楅晜杙柍柈罙篊欣紙筼穉樇柈氈櫂耩棙曄祿栿暙罙杚氍籁穄昪杛耾蛼胦缿耍胄矫荩罴脥紑苧菙旴腣瑅杣桰荴羴暽本暏薣繅桰竰棚枕椴敠曩籌蒽繘懿沥嚄樜葍弚绦聹绊茁脬檁憑絻翌紑色腑恄櫦綟罴膘絾菑忽胄穉縑穓英氉柰膽殤噢津攅罙缲衣沥嚄樜绵篧蝯思羴耍秜翏薣檋憳粤蔰耍撼統绵搻槉惷滋嚵櫔篝苷笝惍粤菑筩脬翏涗忤荤絾耩绉羌忚悭翙薣粤湖惕粴耴蘕纪蘖欯柰晑桤梈曩絻翌紑色筩攤耴蚇絻繳聹蚏日窬縻苷攅柽簷槄籁穄碵綟棷欢柇缿棙棌枾罧棷繳栴檮綅本梈歝窸绦梡沂暽旴敠橹棷枊菡蟮聹穄紌蔱矵葊楻蝹暽莜統蝫泩竛芚棚茁棌笓蔱缏绦臀棚窑晜昪歝敪朗羟薥緱恄櫦囡樦蒽思羴耍秜翏薣檋憳胦肞粭紜縻憑櫰艾蘂菑绉筼弐蒿肣膘腓蒻母斌纠渉噬浡暀耩绉艤櫦囡樦罙缲衣忽窬紌綟翙蘖汶懿籁羌紌晷絻罙斦樹惕殤噢津篧荤繘愕籁織碵薣翙淔惷葆紙笔篝菛忤惍荴蚏籁欼忚肽耾蚉舭蜄櫵斌擻橹梒朗胦肞粭紜碵曩耾蛼胦缿耍胄撖纃繅荤暀肞篕穄秤每礤縀梡缿粭榜棭梱礤欢緫肞楅柼栣橹秮縀簷缿綅榜秤綟穓殕櫂柰荭臼統縑紖薣竰蔰胥缤粧櫫栭氈琠樹棙晜腣柍絻褻栴蔰腑晜矫栿昴殕曭杻缵翴笓憑櫰囫氉薥忽窬紌綟翙蘖汶懿聹筼秤脯繅憳泣疦筩胄粧먯耾縀思硤荭胄縻縑紖葊蒻륊母斌纠渉噬浡篊愕繝胄穉翙檋憳绅蝹荭翴翏汁攅枊蔨裘蒱攤臈蛹篧罙絾蔰茁攤祿菛絻枊蒻色粭筼縻梱柈檯曭槄榱榜暏杛纪蛼簷菑绉窬矫薣穓衕竰绊荭礌耴肽穓級粤色胥筼統綟矵绦絾蒻荭筼罪粻搻級聹色荭膔紌罧禉縀舭蚏绉窬穉晷秮薣絾绊聹脬撖纃繅荤浐薥耍欼昪梱族樼栴楏楅柼慮葍紖菗篊葆紙欼紌脯耾蚉聹肞籁秜纠蔱篧绦絾朆粭胄穉綟絻蘖惷滋耍臼笓綟罴惍舭쒷篕織篝纃繅浡暀绊沥嚄樜杛秮膘蒻滋嚵櫔秤脯脈惍粤菑筩脬翏涗忤绦臀菑敹纼秤晷曾憳泣圇母紜統聋弚绦聹绊茁脬檁憑絻翌紑色腑恄弐薣罴绦汶懿繝膔耴葍翙汻暀柰楅椴撖苷穓罙缲绊日膔肙苷礤英茇杻籁羌統杛梒縀楻楏榱曄旅翙栭棣橕脓栁篤更每秮柽曭樹綅秜敠柍暙绦曭槄紙桤梈樇攅蚉葎葆篕織罪粻絻蔰簷膈紙茴礚椣瑨炆杚蜄篕綄舭櫫柈葊杚締棙旴敠曩籌蒽繘懿沥嚄樜葍弚绦聹绊茁脬檁憑絻翌紑色腑恄櫦捙恉棣槨殘暽旴慮戃昴桰楻氍枕懤怿栿昴樼柇檮抅悬旅梱杣槉曭揓慁晜昪樇昴桰思朆芕羌紌綟弚蚉篊荜绉萄碵蝫碿暤氉柰膽殤噢津攅罙缲衣沥嚄樜绵篧蝯思羴耍秜翏薣檋憳粤蔰耍撼統绵搻槉惷滋嚵櫔篝苷笝惍粤菑筩脬翏涗忤荤絾耩绉羌忚悭翙薣粤湖惕粴耴蘕纪蘖欯柰晑桤梈曩絻翌紑色筩攤耴蚇絻繳聹蚏日窬縻苷攅柽楻肞楅穄昪綟族绦梡沂楅窬更歝曾欢簷脓栁窬穉每梒翌柇氍暽本祿栿穓枊菡蟮聹穄紌蔱矵菗栴檮胥柼栣綟臒英璍棚荭旴纠蘕穓脥臀棚窑晜昪歝敪朗羟薥緱恄櫦囡樦蒽思羴耍秜翏薣檋憳胦肞粭紜縻憑櫰睃缲蜄筩彴玔薣肣艾缲蒻腑彴慮戃昴檯栴殘楅懤怿椣栭楖柇欣抅悬旅梱曾棣楻揓慁晜昪椣栭楖氉柰膽殤噢津攅罙缲衣沥嚄樜绵篧蝯思羴耍秜翏薣檋憳粤蔰耍撼統绵搻槉惷滋嚵櫔篝苷笝惍粤菑筩脬翏涗忤荤絾耩绉羌忚悭翙薣粤湖惕粴耴蘕纪汻暀柰楅椴撖苷穓罙缲绊日膔肙苷礤英茇杻籁羌統杛窸殕杚氍筩枔暏歝礤繳柇棚筩柼栣纃礤楖柇槄粭本碵梱梒氈篊绊棙旴碵翙攅蚉葎葆篕織罪粻繅檯薕蔰朩臼碵苷痼蘖杚蜄榱籌罪蒿禉葊杚締朩曄梈柍撠舋舭膈惕殤噢津纪惍粤菑筩脬翏涗忤荤絾耩绉羌忚渉澬蛼聹色薉秜弐灃樦枊舭滋嚵櫔擻绵篧蝯泣圇母笔篝蛹弚绦聹绊茁脬檁憑禉葊聹朆聹笔搱榕忤湇嚿淡绉纼笓悭禉英篊蜄茁欼忚苷穓罙缲蔰惕彴翏蔱禉淔惷臽荭膔纠薣楜枊暀欣樝攤統罧秮膘篊杻荭臼統縑紖薣易羴腑纼擻梱禉殕橕槄籁棌穉罧禉耿絾肞榱曄昪榕杣绦簷缿紙本祿罧穓柽椎羴篕晜暏杛耾蛼胦缿耍胄矫菛礤檯腓色檉炄筸樇爊桰蒻蘚繝翴更歝繅桰竰棚枕椴敠曩籌蒽繘懿沥嚄樜葍弚绦聹绊茁脬檁憑絻翌紑色腑恄櫦潟脈縀思硤膽秜罪蟝臒衕氉柰膽殤噢津攅罙缲衣沥";
      }
      else if(hi_tori){
        message ="沷粇悷約膷粇薭菤洧愶縛葒芗愶悷缪著繃翣沰慗羐蘟葒荷殞来暬胗粇蜃缪縷膻菥蔮聧繃薭显緇芙茁愖涗犎綩芚뗇芙洯暬糧浚悷求糧恘纍胢糧葕薭沰慗糶蘟膾慗恘胇荶级纲涡愖翷蓄蘟芚蓇殞来暬絗粇脹蘊糧菦胇締芗蓄綩羘暗航罱葒慗浚犇締芗蓄綩羘沷曙綩洞恷汼綩怺緇腌綩菤蓇泫憛粖蔷航憛怺翷菦罱繎洧愶胇葒蔷茈薭武朇曙縛羘菧腌罱显著蔳憛洞癗蔳薭菤聧粇洯暬糧浚"
      }
    let noise = 0;
    var content = [];
      for ( let c = 0; c < message.length; c++ ) {
        let c_message = message.charCodeAt( c );
        let char_iteration = c;
          while ( char_iteration > key.length - 1 ) {
            char_iteration -= key.length ;
          }
          //loop key starting from the last character
          if ( char_iteration < 1 ) {
            noise = key.charCodeAt( char_iteration + 1 );
          }
          else {
            noise = key.charCodeAt( char_iteration - 1 );
          }
        let dec = ( c_message - 21000 - noise ) / key.charCodeAt( char_iteration );
        content.push(String.fromCharCode( dec )) ;
  }
 
    var resultado = content.join("");
   document.getElementById("corpo").innerHTML = resultado;
   
}


// function definir(){
// var text2 = "浡积羋艦庐膘积沣扎繤薣穔菗扎槮砩涴瘗璖沕惍渙盳爦毓猸熦珱犎犥惍爋湛琮燣澠弛瓍泞熂澠弛炁泞燣煬弛柩櫖搿罙篨蔡殦";
// }